In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [3]:
covid=pd.read_csv("China_covid.csv")

In [6]:
covid.describe()

        Total Cases   Total Death
count  1.096000e+03   1096.000000
mean   8.521397e+05   7553.937956
std    1.278578e+06   4856.688434
min    5.480000e+02     17.000000
25%    9.106575e+04   4739.000000
50%    1.045255e+05   4848.000000
75%    1.986943e+06  13935.000000
max    4.885426e+06  18508.000000

In [7]:
covid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1096 entries, 0 to 1095
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         1096 non-null   object
 1   Total Cases  1096 non-null   int64
 2   Total Death  1096 non-null   int64
dtypes: int64(2), object(1)
memory usage: 25.8+ KB

In [8]:
covid.dtypes

Date           object
Total Cases     int64
Total Death     int64
dtype: object

In [9]:
covid.isnull().sum()

Date           0
Total Cases    0
Total Death    0
dtype: int64

In [10]:
covid.max()

Date           31 Oct 22
Total Cases      4885426
Total Death        18508
dtype: object

In [11]:
covid.min()

Date           01 Apr 20
Total Cases          548
Total Death           17
dtype: object

In [12]:
covid.mean()

C:\Users\Terrie Ann\AppData\Local\Temp\ipykernel_7812\1682108217.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  covid.mean()

Total Cases    852139.692518
Total Death      7553.937956
dtype: float64

In [13]:
covid.mode()

           Date  Total Cases  Total Death
0     01 Apr 20      84063.0       4849.0
1     01 Apr 21          NaN          NaN
2     01 Apr 22          NaN          NaN
3     01 Aug 20          NaN          NaN
4     01 Aug 21          NaN          NaN
...         ...          ...          ...
1091  31 May 21          NaN          NaN
1092  31 May 22          NaN          NaN
1093  31 Oct 20          NaN          NaN
1094  31 Oct 21          NaN          NaN
1095  31 Oct 22          NaN          NaN

[1096 rows x 3 columns]

In [14]:
covid.median()

C:\Users\Terrie Ann\AppData\Local\Temp\ipykernel_7812\3864138544.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  covid.median()

Total Cases    104525.5
Total Death      4848.0
dtype: float64

In [15]:
covid.groupby('Date').max()

           Total Cases  Total Death
Date
01 Apr 20        82245         3309
01 Apr 21       101732         4841
01 Apr 22      1385495        12463
01 Aug 20        87655         4661
01 Aug 21       105050         4848
...                ...          ...
31 May 21       102987         4846
31 May 22      2096200        14604
31 Oct 20        91339         4739
31 Oct 21       109574         4849
31 Oct 22      2944653        15617

[1096 rows x 2 columns]

In [16]:
covid.groupby('Total Death').min()

                  Date  Total Cases
Total Death
17           23 Jan 20          548
18           24 Jan 20          643
26           25 Jan 20          920
42           26 Jan 20         1406
56           27 Jan 20         2075
...                ...          ...
18352        19 Jan 23      4871355
18399        20 Jan 23      4875374
18441        21 Jan 23      4879169
18470        22 Jan 23      4882683
18508        23 Jan 23      4885426

[530 rows x 2 columns]

DATA VISUALIZATION

In [1]:
#PIE CHART